Repository: thangvta/picar
Catalog: robot-hat/docs/source/locale/*/LC_MESSAGES/api_robot.po
Languages: de

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo und willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasten-Gemeinschaft auf Facebook! Tauchen Sie tiefer ein in die Welt von Raspberry Pi, Arduino und ESP32 mit anderen Enthusiasten.

source: **Why Join?**
de: **Warum beitreten?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Expertenunterstützung**: Lösen Sie Nachverkaufsprobleme und technische Herausforderungen mit Hilfe unserer Gemeinschaft und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen**: Tauschen Sie Tipps und Anleitungen aus, um Ihre Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen**: Erhalten Sie frühzeitigen Zugang zu neuen Produktankündigungen und exklusiven Einblicken.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Spezialrabatte**: Genießen Sie exklusive Rabatte auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele**: Nehmen Sie an Gewinnspielen und Feiertagsaktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Sind Sie bereit, mit uns zu erkunden und zu erschaffen? Klicken Sie auf [|link_sf_facebook|] und treten Sie heute bei!

source: class ``Robot``
de: Klasse ``Robot``

source: **Example**
de: **Beispiel**

source: Bases: :py:class:`~robot_hat.basic._Basic_class`
de: Basisklasse: :py:class:`~robot_hat.basic._Basic_class`

source: Robot class
de: Robot-Klasse

source: This class is for makeing a servo robot with Robot HAT
de: Diese Klasse dient zum Erstellen eines Servo-Roboters mit dem Robot HAT

source: There are servo initialization, all servo move in specific speed. servo offset and stuff. make it easy to make a robot. All Pi-series robot from SunFounder use this class. Check them out for more details.
de: Es gibt eine Servo-Initialisierung, alle Servos bewegen sich mit einer spezifischen Geschwindigkeit. Servo-Offset und so weiter. Es erleichtert das Erstellen eines Roboters. Alle Pi-Serie Roboter von SunFounder verwenden diese Klasse. Schauen Sie sich diese für weitere Details an.

source: Preset actions
de: Voreingestellte Aktionen

source: Servo max Degree Per Second
de: Servo maximale Grad pro Sekunde

source: Initialize the robot class
de: Die Robot-Klasse initialisieren

source: Parameters
de: Parameter

source: list of pin number[0-11]
de: Liste der Pin-Nummern [0-11]

source: config file path
de: Pfad zur Konfigurationsdatei

source: robot name
de: Robotername

source: list of initial angles
de: Liste der Anfangswinkel

source: list of initialization order(Servos will init one by one in case of sudden huge current, pulling down the power supply voltage. default order is the pin list. in some cases, you need different order, use this parameter to set it.)
de: Liste der Initialisierungsreihenfolge (Servos werden einzeln initialisiert, falls es zu einem plötzlichen starken Strom kommt, der die Spannung der Stromversorgung herunterzieht. Die Standardreihenfolge ist die Pin-Liste. In einigen Fällen benötigen Sie eine andere Reihenfolge, verwenden Sie diesen Parameter, um sie festzulegen.)

source: Create a list of servo angles with default value
de: Erstellen Sie eine Liste von Servowinkeln mit Standardwert

source: default value of servo angles
de: Standardwert der Servowinkel

source: Returns
de: Rückgabe

source: list of servo angles
de: Liste der Servowinkel

source: Return type
de: Rückgabetyp

source: Set servo angles to specific raw angles
de: Servowinkel auf spezifische Rohwinkel einstellen

source: Set servo angles to specific angles with original angle and offset
de: Servowinkel mit ursprünglichem Winkel und Offset auf spezifische Winkel einstellen

source: Move servo to specific angles with speed or bpm
de: Servo mit Geschwindigkeit oder bpm auf spezifische Winkel bewegen

source: speed of servo move
de: Geschwindigkeit der Servobewegung

source: beats per minute
de: Schläge pro Minute

source: Do prefix action with motion_name and step and speed
de: Führen Sie eine vordefinierte Aktion mit Bewegungsname, Schritt und Geschwindigkeit aus

source: motion
de: Bewegung

source: step of motion
de: Schritt der Bewegung

source: speed of motion
de: Geschwindigkeit der Bewegung

source: Set offset of servo angles
de: Offset der Servowinkel einstellen

source: Move all servos to home position
de: Alle Servos in die Ausgangsposition bewegen

source: Reset servo to original position
de: Servo in die ursprüngliche Position zurücksetzen
