Repository: thangvta/picar
Catalog: robot-hat/docs/source/locale/*/LC_MESSAGES/api_motor.po
Languages: de, ja

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo und willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasten-Gemeinschaft auf Facebook! Tauchen Sie tiefer ein in die Welt von Raspberry Pi, Arduino und ESP32 mit anderen Enthusiasten.
ja: こんにちは、SunFounderのRaspberry Pi & Arduino & ESP32愛好家コミュニティへようこそ！Facebook上でRaspberry Pi、Arduino、ESP32についてもっと深く掘り下げ、他の愛好家と交流しましょう。

source: **Why Join?**
de: **Warum beitreten?**
ja: **参加する理由は？**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Expertenunterstützung**: Lösen Sie Nachverkaufsprobleme und technische Herausforderungen mit Hilfe unserer Gemeinschaft und unseres Teams.
ja: **エキスパートサポート**：コミュニティやチームの助けを借りて、販売後の問題や技術的な課題を解決します。

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen**: Tauschen Sie Tipps und Anleitungen aus, um Ihre Fähigkeiten zu verbessern.
ja: **学び＆共有**：ヒントやチュートリアルを交換してスキルを向上させましょう。

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen**: Erhalten Sie frühzeitigen Zugang zu neuen Produktankündigungen und exklusiven Einblicken.
ja: **独占的なプレビュー**：新製品の発表や先行プレビューに早期アクセスしましょう。

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Spezialrabatte**: Genießen Sie exklusive Rabatte auf unsere neuesten Produkte.
ja: **特別割引**：最新製品の独占割引をお楽しみください。

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele**: Nehmen Sie an Gewinnspielen und Feiertagsaktionen teil.
ja: **祭りのプロモーションとギフト**：ギフトや祝日のプロモーションに参加しましょう。

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Sind Sie bereit, mit uns zu erkunden und zu erschaffen? Klicken Sie auf [|link_sf_facebook|] und treten Sie heute bei!
ja: 👉 私たちと一緒に探索し、創造する準備はできていますか？[|link_sf_facebook|]をクリックして今すぐ参加しましょう！

source: module ``motor``
de: Modul ``motor``
ja: モジュール ``motor``

source: class ``Motors``
de: Klasse ``Motors``
ja: クラス ``Motors``

source: **Example**
de: **Beispiel**
ja: **例**

source: Initilize
de: Initialisieren
ja: 初期化

source: Directly control a motor. Motor 1/2 is according to PCB mark
de: Direkte Steuerung eines Motors. Motor 1/2 entspricht der Kennzeichnung auf der Platine
ja: モーターを直接制御します。モーター1/2はPCBのマークに従います

source: Setup for high level control, high level control provides functions from simple forword, backward, left, right, stop to more complex like joystick control, motor directions calibration, etc.
de: Einrichtung für hochrangige Steuerung, welche Funktionen von einfachen Bewegungen wie Vorwärts, Rückwärts, Links, Rechts, Stopp bis zu komplexeren wie Joysticksteuerung, Kalibrierung der Motorenrichtung usw. bereitstellt.
ja: ハイレベル制御の設定を行います。ハイレベル制御は、単純な前進、後退、左、右、停止から、ジョイスティック制御、モーター方向のキャリブレーションなどの複雑な機能を提供します。

source: All these setup only need to run once, and will save in a config file. Next time you load Motors class, it will load from config file.
de: All diese Einrichtungen müssen nur einmal ausgeführt werden und werden in einer Konfigurationsdatei gespeichert. Wenn Sie das nächste Mal die Klasse Motors laden, wird sie aus der Konfigurationsdatei geladen.
ja: これらの設定は一度だけ実行する必要があり、設定ファイルに保存されます。次にMotorsクラスをロードするときは、設定ファイルからロードされます。

source: Now control the robot
de: Jetzt den Roboter steuern
ja: これでロボットを制御できます

source: Bases: :py:class:`~robot_hat.basic._Basic_class`
de: Basisklasse: :py:class:`~robot_hat.basic._Basic_class`
ja: 基底: :py:class:`~robot_hat.basic._Basic_class`

source: Initialize motors with robot_hat.motor.Motor
de: Motoren mit robot_hat.motor.Motor initialisieren
ja: robot_hat.motor.Motorでモーターを初期化

source: Parameters
de: Parameter
ja: パラメータ

source: config file path
de: Pfad zur Konfigurationsdatei
ja: 設定ファイルのパス

source: Get specific motor
de: Spezifischen Motor abrufen
ja: 特定のモーターを取得する

source: Stop all motors
de: Alle Motoren stoppen
ja: すべてのモーターを停止する

source: left motor
de: linker Motor
ja: 左のモーター

source: right motor
de: rechter Motor
ja: 右のモーター

source: Set left motor id, this function only need to run once It will save the motor id to config file, and load the motor id when the class is initialized
de: Linke Motor-ID einstellen, diese Funktion muss nur einmal ausgeführt werden. Sie speichert die Motor-ID in der Konfigurationsdatei und lädt sie beim Initialisieren der Klasse.
ja: 左のモーターIDを設定します。この機能は一度だけ実行する必要があり、モーターIDを設定ファイルに保存し、クラスが初期化されるときにモーターIDをロードします。

source: motor id (1 or 2)
de: Motor-ID (1 oder 2)
ja: モーターID（1または2）

source: Set right motor id, this function only need to run once It will save the motor id to config file, and load the motor id when the class is initialized
de: Rechte Motor-ID einstellen, diese Funktion muss nur einmal ausgeführt werden. Sie speichert die Motor-ID in der Konfigurationsdatei und lädt sie beim Initialisieren der Klasse.
ja: 右のモーターIDを設定します。この機能は一度だけ実行する必要があり、モーターIDを設定ファイルに保存し、クラスが初期化されるときにモーターIDをロードします。

source: Set left motor reverse, this function only need to run once It will save the reversed status to config file, and load the reversed status when the class is initialized
de: Linken Motor umkehren, diese Funktion muss nur einmal ausgeführt werden. Sie speichert den umgekehrten Status in der Konfigurationsdatei und lädt diesen beim Initialisieren der Klasse.
ja: 左のモーターを逆回転に設定します。この機能は一度だけ実行する必要があり、逆回転の状態を設定ファイルに保存し、クラスが初期化されるときに逆回転の状態をロードします。

source: Returns
de: Rückgabe

source: if currently is reversed
de: ob derzeit umgekehrt ist
ja: 現在逆回転しているかどうか

source: Return type
de: Rückgabetyp
ja: 戻り値の型

source: Set right motor reverse, this function only need to run once It will save the reversed status to config file, and load the reversed status when the class is initialized
de: Rechten Motor umkehren, diese Funktion muss nur einmal ausgeführt werden. Sie speichert den umgekehrten Status in der Konfigurationsdatei und lädt diesen beim Initialisieren der Klasse.
ja: 右のモーターを逆回転に設定します。この機能は一度だけ実行する必要があり、逆回転の状態を設定ファイルに保存し、クラスが初期化されるときに逆回転の状態をロードします。

source: Set motor speed
de: Motorgeschwindigkeit einstellen
ja: モーター速度を設定する

source: left motor speed(-100.0~100.0)
de: Geschwindigkeit des linken Motors (-100,0 bis 100,0)
ja: 左モーターの速度(-100.0~100.0)

source: right motor speed(-100.0~100.0)
de: Geschwindigkeit des rechten Motors (-100,0 bis 100,0)
ja: 右モーターの速度(-100.0~100.0)

source: Forward
de: Vorwärts
ja: 前進

source: Motor speed(-100.0~100.0)
de: Motorgeschwindigkeit (-100,0 bis 100,0)
ja: モーター速度(-100.0~100.0)

source: Backward
de: Rückwärts
ja: 後退

source: Left turn
de: Links abbiegen
ja: 左折

source: Right turn
de: Rechts abbiegen
ja: 右折

source: class ``Motor``
de: Klasse ``Motor``
ja: クラス ``Motor``

source: Bases: :py:class:`object`
de: Basisklasse: :py:class:`object`
ja: 基底: :py:class:`object`

source: Initialize a motor
de: Einen Motor initialisieren
ja: モーターを初期化する

source: Motor speed control pwm pin
de: PWM-Pin zur Geschwindigkeitssteuerung des Motors
ja: モーター速度制御用PWMピン

source: Motor direction control pin
de: Pin zur Steuerung der Motorenrichtung
ja: モーター方向制御ピン

source: Get or set motor speed
de: Motorgeschwindigkeit abrufen oder einstellen
ja: モーター速度の取得または設定

source: Set motor is reversed or not
de: Motor umkehren oder nicht
ja: モーターの逆転を設定するかどうか

source: True or False
de: Wahr oder Falsch
ja: True または False
