Repository: thangvta/picar
Catalog: robot-hat/docs/source/locale/*/LC_MESSAGES/api_filedb.po
Languages: de, ja

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo und willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasten-Gemeinschaft auf Facebook! Tauchen Sie tiefer ein in die Welt von Raspberry Pi, Arduino und ESP32 mit anderen Enthusiasten.
ja: こんにちは、SunFounderのRaspberry Pi & Arduino & ESP32愛好家コミュニティへようこそ！Facebook上でRaspberry Pi、Arduino、ESP32についてもっと深く掘り下げ、他の愛好家と交流しましょう。

source: **Why Join?**
de: **Warum beitreten?**
ja: **参加する理由は？**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Expertenunterstützung**: Lösen Sie Nachverkaufsprobleme und technische Herausforderungen mit Hilfe unserer Gemeinschaft und unseres Teams.
ja: **エキスパートサポート**：コミュニティやチームの助けを借りて、販売後の問題や技術的な課題を解決します。

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen**: Tauschen Sie Tipps und Anleitungen aus, um Ihre Fähigkeiten zu verbessern.
ja: **学び＆共有**：ヒントやチュートリアルを交換してスキルを向上させましょう。

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen**: Erhalten Sie frühzeitigen Zugang zu neuen Produktankündigungen und exklusiven Einblicken.
ja: **独占的なプレビュー**：新製品の発表や先行プレビューに早期アクセスしましょう。

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Spezialrabatte**: Genießen Sie exklusive Rabatte auf unsere neuesten Produkte.
ja: **特別割引**：最新製品の独占割引をお楽しみください。

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele**: Nehmen Sie an Gewinnspielen und Feiertagsaktionen teil.
ja: **祭りのプロモーションとギフト**：ギフトや祝日のプロモーションに参加しましょう。

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Sind Sie bereit, mit uns zu erkunden und zu erschaffen? Klicken Sie auf [|link_sf_facebook|] und treten Sie heute bei!
ja: 👉 私たちと一緒に探索し、創造する準備はできていますか？[|link_sf_facebook|]をクリックして今すぐ参加しましょう！

source: class ``FileDB``
de: Klasse ``FileDB``
ja: クラス ``FileDB``

source: **Example**
de: **Beispiel**
ja: **例**

source: Now you can checkout the config file ``config`` in bash.
de: Jetzt können Sie die Konfigurationsdatei ``config`` in Bash überprüfen.
ja: これでbashで設定ファイル ``config`` を確認できます。

source: Bases: :py:class:`object`
de: Basen: :py:class:`object`
ja: 基底: :py:class:`object`

source: A file based database.
de: Eine dateibasierte Datenbank.
ja: ファイルベースのデータベース。

source: A file based database, read and write arguements in the specific file.
de: Eine dateibasierte Datenbank zum Lesen und Schreiben von Argumenten in einer bestimmten Datei.
ja: 特定のファイルで引数を読み書きするファイルベースのデータベースです。

source: Init the db_file is a file to save the datas.
de: Initialisiere db_file als Datei zum Speichern der Daten.
ja: db_fileを初期化すると、データを保存するファイルになります。

source: Parameters
de: Parameter
ja: パラメータ

source: the file to save the datas.
de: Die Datei zum Speichern der Daten.
ja: データを保存するファイル。

source: the mode of the file.
de: Der Modus der Datei.
ja: ファイルのモード。

source: the owner of the file.
de: Der Besitzer der Datei.
ja: ファイルの所有者。

source: Check if file is existed, otherwise create one.
de: Überprüfen, ob die Datei existiert, ansonsten eine erstellen.
ja: ファイルが存在するかチェックし、存在しない場合は作成する。

source: the file to check
de: Die zu überprüfende Datei
ja: チェックするファイル

source: Get value with data's name
de: Wert mit dem Namen der Daten abrufen
ja: データの名前で値を取得する

source: the name of the arguement
de: Der Name des Arguments
ja: 引数の名前

source: the default value of the arguement
de: Der Standardwert des Arguments
ja: 引数のデフォルト値

source: Returns
de: Rückgabe
ja: 戻り値

source: the value of the arguement
de: Der Wert des Arguments
ja: 引数の値

source: Return type
de: Rückgabetyp
ja: 戻り値の型

source: Set value by with name. Or create one if the arguement does not exist
de: Wert anhand des Namens setzen. Oder eines erstellen, falls das Argument nicht existiert
ja: 名前で値を設定する。または、引数が存在しない場合は作成する
