Repository: thangvta/picar
Catalog: robot-hat/docs/source/locale/*/LC_MESSAGES/faq.po
Languages: de

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo und willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasten-Gemeinschaft auf Facebook! Tauchen Sie tiefer ein in die Welt von Raspberry Pi, Arduino und ESP32 mit anderen Enthusiasten.

source: **Why Join?**
de: **Warum beitreten?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Expertenunterstützung**: Lösen Sie Nachverkaufsprobleme und technische Herausforderungen mit Hilfe unserer Gemeinschaft und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen**: Tauschen Sie Tipps und Anleitungen aus, um Ihre Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen**: Erhalten Sie frühzeitigen Zugang zu neuen Produktankündigungen und exklusiven Einblicken.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Spezialrabatte**: Genießen Sie exklusive Rabatte auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele**: Nehmen Sie an Gewinnspielen und Feiertagsaktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Sind Sie bereit, mit uns zu erkunden und zu erschaffen? Klicken Sie auf [|link_sf_facebook|] und treten Sie heute bei!

source: Q1: Can the battery be connected while providing power to the Raspberry Pi at the same time?
de: F1: Kann die Batterie angeschlossen werden, während gleichzeitig Strom an den Raspberry Pi geliefert wird?

source: A: Yes, the Robot HAT has a built-in anti-backflow diode that prevents the Raspberry Pi's power from flowing back into the Robot HAT.
de: A: Ja, der Robot HAT hat eine eingebaute Anti-Rückflussdiode, die verhindert, dass die Stromversorgung des Raspberry Pi zurück in den Robot HAT fließt.

source: Q2: Can the Robot HAT be used while charging?
de: F2: Kann der Robot HAT während des Ladens verwendet werden?

source: A: Yes, the Robot HAT can be used while charging. When charging, the input power is boosted by the charging chip to charge the batteries, while also providing power to the DC-DC step-down for external use. The charging power is approximately 10W. If the external power consumption is too high for an extended period, the batteries may supplement the power, similar to how a mobile phone charges while in use. However, it is important to be mindful of the battery's capacity to avoid draining it completely during simultaneous charging and usage.
de: A: Ja, der Robot HAT kann während des Ladens verwendet werden. Beim Laden wird die Eingangsleistung durch den Ladungschip verstärkt, um die Batterien zu laden, während gleichzeitig Strom für die DC-DC-Herabsetzung für den externen Gebrauch bereitgestellt wird. Die Ladeleistung beträgt etwa 10W. Wenn der externe Stromverbrauch über einen längeren Zeitraum zu hoch ist, können die Batterien die Stromversorgung ergänzen, ähnlich wie ein Mobiltelefon beim Gebrauch aufgeladen wird. Es ist jedoch wichtig, auf die Kapazität der Batterie zu achten, um ein vollständiges Entleeren während des gleichzeitigen Ladens und Gebrauchs zu vermeiden.

source: Q3: Why is there no sound from the speaker?
de: F3: Warum kommt kein Ton aus dem Lautsprecher?

source: When your script is running but the speaker is not producing sound, there could be several reasons:
de: Wenn Ihr Skript läuft, aber der Lautsprecher keinen Ton erzeugt, könnte es mehrere Gründe geben:

source: Check if the ``i2samp.sh`` script has been installed. For detailed instructions, please refer to: :ref:`install_i2s`.
de: Überprüfen Sie, ob das Skript ``i2samp.sh`` installiert wurde. Für detaillierte Anweisungen siehe: :ref:`install_i2s`.

source: When running scripts related to speakers, it's necessary to add ``sudo`` to obtain administrative privileges. For example, ``sudo python3 tts.py``.
de: Beim Ausführen von Skripten, die mit Lautsprechern zusammenhängen, ist es notwendig, ``sudo`` hinzuzufügen, um administrative Rechte zu erhalten. Zum Beispiel ``sudo python3 tts.py``.

source: Don't using Raspberry Pi's built-in programming tools, like Geany to run Speaker-related scripts. These tools run with standard user privileges, while hardware control, such as managing speakers, often requires higher permissions.
de: Verwenden Sie keine integrierten Programmierwerkzeuge des Raspberry Pi, wie Geany, um lautsprecherbezogene Skripte auszuführen. Diese Werkzeuge laufen mit Standardbenutzerrechten, während die Hardwaresteuerung, wie die Verwaltung von Lautsprechern, oft höhere Berechtigungen erfordert.
