Repository: thangvta/picar
Catalog: robot-hat/docs/source/locale/*/LC_MESSAGES/install_i2s_for_speaker.po
Languages: de

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo und willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasten-Gemeinschaft auf Facebook! Tauchen Sie tiefer ein in die Welt von Raspberry Pi, Arduino und ESP32 mit anderen Enthusiasten.

source: **Why Join?**
de: **Warum beitreten?**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Expertenunterstützung**: Lösen Sie Nachverkaufsprobleme und technische Herausforderungen mit Hilfe unserer Gemeinschaft und unseres Teams.

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen**: Tauschen Sie Tipps und Anleitungen aus, um Ihre Fähigkeiten zu verbessern.

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen**: Erhalten Sie frühzeitigen Zugang zu neuen Produktankündigungen und exklusiven Einblicken.

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Spezialrabatte**: Genießen Sie exklusive Rabatte auf unsere neuesten Produkte.

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele**: Nehmen Sie an Gewinnspielen und Feiertagsaktionen teil.

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Sind Sie bereit, mit uns zu erkunden und zu erschaffen? Klicken Sie auf [|link_sf_facebook|] und treten Sie heute bei!

source: Install ``i2samp.sh`` for the Speaker
de: Installieren Sie ``i2samp.sh`` für den Lautsprecher

source: The ``i2samp.sh`` is a sophisticated Bash script specifically designed for setting up and configuring an I2S (Inter-IC Sound) amplifier on Raspberry Pi and similar devices. Licensed under the MIT license, it ensures compatibility with a range of hardware and operating systems, conducting thorough checks before proceeding with any installation or configuration.
de: Das ``i2samp.sh`` ist ein ausgefeiltes Bash-Skript, das speziell für die Einrichtung und Konfiguration eines I2S (Inter-IC Sound) Verstärkers auf Raspberry Pi und ähnlichen Geräten entwickelt wurde. Unter der MIT-Lizenz lizenziert, gewährleistet es die Kompatibilität mit einer Vielzahl von Hardware- und Betriebssystemen und führt gründliche Überprüfungen durch, bevor mit irgendeiner Installation oder Konfiguration fortgefahren wird.

source: If you want your speaker to work properly, you definitely need to install this script.
de: Wenn Sie möchten, dass Ihr Lautsprecher ordnungsgemäß funktioniert, müssen Sie dieses Skript definitiv installieren.

source: The steps are as follows:
de: Die Schritte sind wie folgt:

source: Type ``y`` and press ``enter`` to continue running the script.
de: Geben Sie ``y`` ein und drücken Sie ``Enter``, um das Skript weiter auszuführen.

source: Type ``y`` and press ``enter`` to run ``/dev/zero`` in the background.
de: Geben Sie ``y`` ein und drücken Sie ``Enter``, um ``/dev/zero`` im Hintergrund auszuführen.

source: Type ``y`` and press ``enter`` to restart the Raspberry pi.
de: Geben Sie ``y`` ein und drücken Sie ``Enter``, um den Raspberry Pi neu zu starten.

source: If there is no sound after restarting, you may need to run the ``i2samp.sh`` script several times.
de: Wenn nach dem Neustart kein Ton vorhanden ist, müssen Sie möglicherweise das ``i2samp.sh``-Skript mehrmals ausführen.
