Repository: thangvta/picar
Catalog: robot-hat/docs/source/locale/*/LC_MESSAGES/onboard_mcu.po
Languages: de, ja

source: Hello, welcome to the SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasts Community on Facebook! Dive deeper into Raspberry Pi, Arduino, and ESP32 with fellow enthusiasts.
de: Hallo und willkommen in der SunFounder Raspberry Pi & Arduino & ESP32 Enthusiasten-Gemeinschaft auf Facebook! Tauchen Sie tiefer ein in die Welt von Raspberry Pi, Arduino und ESP32 mit anderen Enthusiasten.
ja: こんにちは、SunFounderのRaspberry Pi & Arduino & ESP32愛好家コミュニティへようこそ！Facebook上でRaspberry Pi、Arduino、ESP32についてもっと深く掘り下げ、他の愛好家と交流しましょう。

source: **Why Join?**
de: **Warum beitreten?**
ja: **参加する理由は？**

source: **Expert Support**: Solve post-sale issues and technical challenges with help from our community and team.
de: **Expertenunterstützung**: Lösen Sie Nachverkaufsprobleme und technische Herausforderungen mit Hilfe unserer Gemeinschaft und unseres Teams.
ja: **エキスパートサポート**：コミュニティやチームの助けを借りて、販売後の問題や技術的な課題を解決します。

source: **Learn & Share**: Exchange tips and tutorials to enhance your skills.
de: **Lernen & Teilen**: Tauschen Sie Tipps und Anleitungen aus, um Ihre Fähigkeiten zu verbessern.
ja: **学び＆共有**：ヒントやチュートリアルを交換してスキルを向上させましょう。

source: **Exclusive Previews**: Get early access to new product announcements and sneak peeks.
de: **Exklusive Vorschauen**: Erhalten Sie frühzeitigen Zugang zu neuen Produktankündigungen und exklusiven Einblicken.
ja: **独占的なプレビュー**：新製品の発表や先行プレビューに早期アクセスしましょう。

source: **Special Discounts**: Enjoy exclusive discounts on our newest products.
de: **Spezialrabatte**: Genießen Sie exklusive Rabatte auf unsere neuesten Produkte.
ja: **特別割引**：最新製品の独占割引をお楽しみください。

source: **Festive Promotions and Giveaways**: Take part in giveaways and holiday promotions.
de: **Festliche Aktionen und Gewinnspiele**: Nehmen Sie an Gewinnspielen und Feiertagsaktionen teil.
ja: **祭りのプロモーションとギフト**：ギフトや祝日のプロモーションに参加しましょう。

source: 👉 Ready to explore and create with us? Click [|link_sf_facebook|] and join today!
de: 👉 Sind Sie bereit, mit uns zu erkunden und zu erschaffen? Klicken Sie auf [|link_sf_facebook|] und treten Sie heute bei!
ja: 👉 私たちと一緒に探索し、創造する準備はできていますか？[|link_sf_facebook|]をクリックして今すぐ参加しましょう！

source: On-Board MCU
ja: オンボードMCU

source: The Robot HAT comes with an AT32F413CBT7 microcontroller from Artery. It is an ARM Cortex-M4 processor with a maximum clock frequency of 200MHz. The microcontroller has 128KB of Flash memory and 32KB of SRAM.
de: Der Robot HAT ist mit einem AT32F415CBT7 Mikrocontroller von Artery ausgestattet. Es handelt sich um einen ARM Cortex-M4 Prozessor mit einer maximalen Taktfrequenz von 150MHz. Der Mikrocontroller verfügt über 256KB Flash-Speicher und 32KB SRAM.
ja: Robot HATは、ArteryのAT32F415CBT7マイクロコントローラーを搭載しています。これは、最大クロック周波数が150MHzのARM Cortex-M4プロセッサーです。マイクロコントローラーには、256KBのフラッシュメモリと32KBのSRAMがあります。

source: The onboard PWM and ADC are driven by the microcontroller. Communication between the Raspberry Pi and the microcontroller is established via the I2C interface. The I2C address used for communication is 0x14 (7-bit address format).
de: Das Onboard-PWM und ADC werden vom Mikrocontroller gesteuert. Die Kommunikation zwischen dem Raspberry Pi und dem Mikrocontroller erfolgt über die I2C-Schnittstelle. Die für die Kommunikation verwendete I2C-Adresse ist 0x14 (7-Bit-Adressformat).
ja: オンボードのPWMとADCは、マイクロコントローラによって駆動されます。Raspberry Piとマイクロコントローラ間の通信は、I2Cインターフェイスを通じて確立されます。通信に使用されるI2Cアドレスは0x14（7ビットアドレス形式）です。

source: Introduce
de: Einführung
ja: 紹介

source: The on board MCU RESET pin is connected to Raspberry Pi GPIO 5, or ``MCURST`` for :py:class:`robot_hat.Pin`. The MCU using 7-bit address ``0x14``.
de: Der RESET-Pin des Onboard-MCU ist mit dem Raspberry Pi GPIO 5 oder ``MCURST`` für :py:class:`robot_hat.Pin` verbunden. Der MCU verwendet die 7-Bit-Adresse ``0x14``.
ja: オンボードMCUのRESETピンは、Raspberry PiのGPIO 5、または :py:class:`robot_hat.Pin` の ``MCURST`` に接続されています。MCUは7ビットアドレスの ``0x14`` を使用しています。

source: Register addresses is 3 byte, 0x170000 to 0x140000 are ADC channels 0 to 3. The ADC precision is 12 bit, and the value is 0 to 4095. See more details in :py:class:`robot_hat.ADC`.
de: Registeradressen sind 3 Byte, von 0x170000 bis 0x140000 sind es ADC-Kanäle 0 bis 3. Die ADC-Präzision beträgt 12 Bit, und der Wert liegt zwischen 0 und 4095. Weitere Einzelheiten finden Sie in :py:class:`robot_hat.ADC`.
ja: レジスタアドレスは3バイトで、0x170000から0x140000までがADCチャンネル0から3です。ADCの精度は12ビットで、値は0から4095までです。:py:class:`robot_hat.ADC` で詳細を確認してください。

source: Address
de: Adresse
ja: アドレス

source: Description
de: Beschreibung
ja: 説明

source: ADC channel 0
de: ADC-Kanal 0
ja: ADCチャンネル0

source: ADC channel 1
de: ADC-Kanal 1
ja: ADCチャンネル1

source: ADC channel 2
de: ADC-Kanal 2
ja: ADCチャンネル2

source: ADC channel 3
de: ADC-Kanal 3
ja: ADCチャンネル3

source: ADC channel 4 (Battery Level)
de: ADC-Kanal 4 (Batteriestand)
ja: ADCチャンネル4（バッテリーレベル）

source: **Example:**
de: **Beispiel:**
ja: **例:**

source: Read Channel 0 ADC value:
de: ADC-Wert des Kanals 0 lesen:
ja: チャンネル0のADC値を読む:

source: PWM have 1 byte register with 2 byte values.
de: PWM hat ein 1-Byte-Register mit 2-Byte-Werten.
ja: PWMは1バイトのレジスタと2バイトの値を持っています。

source: Changing PWM Frequency
de: Ändern der PWM-Frequenz
ja: PWM周波数の変更

source: Frequency is defined with prescaler and period.
de: Die Frequenz wird mit Vorwähler und Periode definiert.
ja: 周波数はプリスケーラと周期で定義されます。

source: To set frequency first you need to define the period you want. Like on Arduino, normaly is 255, or like PCA9685 is 4095.
de: Um die Frequenz einzustellen, müssen Sie zuerst die gewünschte Periode definieren. Wie bei Arduino ist dies normalerweise 255, oder wie bei PCA9685 4095.
ja: 周波数を設定するには、まず設定したい周期を定義する必要があります。Arduinoでは通常255、PCA9685では4095です。

source: CPU clock is 72MHz, Then you can calculate the prescaler from your desire frequency
de: Die CPU-Taktfrequenz beträgt 72 MHz. Dann können Sie den Vorwähler aus Ihrer gewünschten Frequenz berechnen
ja: CPUクロックは72MHzです。そこから、希望の周波数に応じたプリスケーラを計算できます

source: prescaler = 72MHz / (Period + 1) / Frequency - 1
de: Vorwähler = 72MHz / (Periode + 1) / Frequenz - 1
ja: プリスケーラ = 72MHz / (周期 + 1) / 周波数 - 1

source: Or if you don't care about the period, there's a way to calculate both period and prescaler from frequency. See :py:func:`robot_hat.PWM.freq`.
de: Wenn Ihnen die Periode egal ist, gibt es eine Möglichkeit, sowohl die Periode als auch den Vorwähler aus der Frequenz zu berechnen. Siehe :py:func:`robot_hat.PWM.freq`.
ja: 周期にこだわらない場合は、周波数から周期とプリスケーラの両方を計算する方法があります。 :py:func:`robot_hat.PWM.freq` を参照してください。

source: Pulse width
de: Pulsbreite
ja: パルス幅

source: To control the channel pulse width is rather simple, just write the value to the register.
de: Die Kontrolle der Pulsbreite des Kanals ist recht einfach, schreiben Sie einfach den Wert in das Register.
ja: チャンネルのパルス幅を制御するのは簡単で、値をレジスタに書き込むだけです。

source: **But** what is the value? If you want to set the PWM to 50% pulse width, you need to know exactly what the period is. Base on the above calculation, if you set the period to 4095, then set pulse value to 2048 is about 50% pulse width.
de: **Aber** was ist der Wert? Wenn Sie die PWM auf eine 50%-Pulsbreite einstellen möchten, müssen Sie genau wissen, was die Periode ist. Basierend auf der oben genannten Berechnung, wenn Sie die Periode auf 4095 einstellen, dann entspricht das Setzen des Puls-Wertes auf 2048 ungefähr einer 50%-Pulsbreite.
ja: **しかし** 値とは何か？PWMを50%のパルス幅に設定したい場合、周期が正確に何であるかを知る必要があります。上記の計算に基づき、周期を4095に設定した場合、パルス値を2048に設定すると、約50%のパルス幅になります。

source: Set PWM channel 0 **On Value**
de: PWM-Kanal 0 **Einschaltwert** einstellen
ja: PWMチャンネル0 **オン値** を設定

source: Set PWM channel 1 **On Value**
de: PWM-Kanal 1 **Einschaltwert** einstellen
ja: PWMチャンネル1 **オン値** を設定

source: Set PWM channel 2 **On Value**
de: PWM-Kanal 2 **Einschaltwert** einstellen
ja: PWMチャンネル2の **オン値** を設定

source: Set PWM channel 3 **On Value**
de: PWM-Kanal 3 **Einschaltwert** einstellen
ja: PWMチャンネル3の **オン値** を設定

source: Set PWM channel 4 **On Value**
de: PWM-Kanal 4 **Einschaltwert** einstellen
ja: PWMチャンネル4の **オン値** を設定

source: Set PWM channel 5 **On Value**
de: PWM-Kanal 5 **Einschaltwert** einstellen
ja: PWMチャンネル5の **オン値** を設定

source: Set PWM channel 6 **On Value**
de: PWM-Kanal 6 **Einschaltwert** einstellen
ja: PWMチャンネル6の **オン値** を設定

source: Set PWM channel 7 **On Value**
de: PWM-Kanal 7 **Einschaltwert** einstellen
ja: PWMチャンネル7の **オン値** を設定

source: Set PWM channel 8 **On Value**
de: PWM-Kanal 8 **Einschaltwert** einstellen
ja: PWMチャンネル8の **オン値** を設定

source: Set PWM channel 9 **On Value**
de: PWM-Kanal 9 **Einschaltwert** einstellen
ja: PWMチャンネル9の **オン値** を設定

source: Set PWM channel 10 **On Value**
de: PWM-Kanal 10 **Einschaltwert** einstellen
ja: PWMチャンネル10の **オン値** を設定

source: Set PWM channel 11 **On Value**
de: PWM-Kanal 11 **Einschaltwert** einstellen
ja: PWMチャンネル11の **オン値** を設定

source: Set Motor 2 speed **On Value**
de: Geschwindigkeit von Motor 2 **Einschaltwert** einstellen
ja: モーター2の速度 **オン値** を設定

source: Set Motor 1 speed **On Value**
de: Geschwindigkeit von Motor 1 **Einschaltwert** einstellen
ja: モーター1の速度 **オン値** を設定

source: Prescaler
de: Vorteiler
ja: プリスケーラー

source: Register from 0x40 is to set the PWM prescaler. ranges from 0~65535. There are only 4 timers for all 14 channels. See `PWM Timer(IMPORTANT)`_
de: Register ab 0x40 dienen zur Einstellung des PWM-Vorteilers. Der Bereich umfasst 0~65535. Es gibt nur 4 Timer für alle 14 Kanäle. Siehe `PWM Timer(WICHTIG)`_
ja: 0x40から始まるレジスタはPWMプリスケーラーを設定するためのもので、範囲は0〜65535です。全14チャンネルに対してタイマーは4つのみです。 `PWMタイマー(重要)`_ を参照してください。

source: Set timer 0 **Prescaler**
de: Timer 0 **Vorteiler** einstellen
ja: タイマー0の **プリスケーラー** を設定

source: Set timer 1 **Prescaler**
de: Timer 1 **Vorteiler** einstellen
ja: タイマー1の **プリスケーラー** を設定

source: Set timer 2 **Prescaler**
de: Timer 2 **Vorteiler** einstellen
ja: タイマー2の **プリスケーラー** を設定

source: Set timer 3 **Prescaler**
de: Timer 3 **Vorteiler** einstellen
ja: タイマー3の **プリスケーラー** を設定

source: Period
de: Periode
ja: 周期

source: Register from 0x44 is to set the PWM period. ranges from 0~65535. There are only 4 timers for all 14 channels. See `PWM Timer(IMPORTANT)`_
de: Register ab 0x44 dienen zur Einstellung der PWM-Periode. Der Bereich umfasst 0~65535. Es gibt nur 4 Timer für alle 14 Kanäle. Siehe `PWM Timer(WICHTIG)`_
ja: 0x44から始まるレジスタはPWM周期を設定するためのもので、範囲は0〜65535です。全14チャンネルに対してタイマーは4つのみです。 `PWMタイマー(重要)`_ を参照してください。

source: Set timer 0 **Period**
de: Timer 0 **Periode** einstellen
ja: タイマー0の **周期** を設定

source: Set timer 1 **Period**
de: Timer 1 **Periode** einstellen
ja: タイマー1の **周期** を設定

source: Set timer 2 **Period**
de: Timer 2 **Periode** einstellen
ja: タイマー2の **周期** を設定

source: Set timer 3 **Period**
de: Timer 3 **Periode** einstellen
ja: タイマー3の **周期** を設定

source: PWM Timer(IMPORTANT)
de: PWM-Timer(WICHTIG)
ja: PWMタイマー（重要）

source: What is PWM Timer? PWM Timer is a tool to turn on and off the PWM channel for you.
de: Was ist ein PWM-Timer? Der PWM-Timer ist ein Werkzeug, um den PWM-Kanal für Sie ein- und auszuschalten.
ja: PWMタイマーとは何ですか？PWMタイマーは、PWMチャンネルをオン・オフするためのツールです。

source: The MCU only have 4 timers for PWM: which means you cannot set frequency on different channels at with the same timer.
de: Der MCU hat nur 4 Timer für PWM: Das bedeutet, Sie können die Frequenz nicht für verschiedene Kanäle mit demselben Timer einstellen.
ja: MCUにはPWM用のタイマーが4つしかありません：つまり、同じタイマーで異なるチャンネルの周波数を設定することはできません。

source: Example: if you set frequency on channel 0, channel 1, 2, 3 will be affected. If you change channel 2 frequency, channel 0, 1, 3 will be override.
de: Beispiel: Wenn Sie die Frequenz auf Kanal 0 einstellen, werden die Kanäle 1, 2, 3 beeinflusst. Wenn Sie die Frequenz von Kanal 2 ändern, werden die Kanäle 0, 1, 3 überschrieben.
ja: 例：チャンネル0に周波数を設定すると、チャンネル1、2、3に影響が及びます。チャンネル2の周波数を変更すると、チャンネル0、1、3が上書きされます。

source: This happens like if you want to control both a passive buzzer (who changes frequency all the time) and servo (who needs a fix frequency of 50Hz). Then you should seperate them into two different timer.
de: Dies geschieht beispielsweise, wenn Sie sowohl einen passiven Summer (der ständig die Frequenz ändert) als auch einen Servo (der eine feste Frequenz von 50 Hz benötigt) steuern möchten. Dann sollten Sie diese auf zwei verschiedene Timer aufteilen.
ja: これは、常に周波数を変更するパッシブブザーと固定周波数50Hzが必要なサーボを同時に制御したい場合のような状況です。この場合、それらを2つの異なるタイマーに分けるべきです。

source: Timer
ja: タイマー

source: PWM Channel
de: PWM-Kanal
ja: PWMチャンネル

source: Timer 0
ja: タイマー0

source: Timer 1
ja: タイマー1

source: Timer 2
ja: タイマー2

source: Timer 3
ja: タイマー3

source: 12, 13(for motors)
de: 12, 13 (für Motoren)
ja: 12, 13（モーター用）

source: Example
de: Beispiel
ja: 例

source: Reset MCU
de: MCU zurücksetzen
ja: MCUをリセット

source: Currently the firmware reads a fix 3 byte value, then it can return ADC values or control PWM. Thats why ADC register need 3byte with the latter 2 byte is 0.
de: Derzeit liest die Firmware einen festen 3-Byte-Wert, dann kann sie ADC-Werte zurückgeben oder PWM steuern. Deshalb benötigt das ADC-Register 3 Byte, wobei die letzten 2 Byte 0 sind.
ja: 現在のファームウェアは固定3バイトの値を読み取り、その後ADC値を返すかPWMを制御できます。そのためADCレジスタは最後の2バイトが0の3バイトが必要です。

source: And if your program is interrupted in the middle of the communication, the firmware may stuck and offset the data. Even we have timeout on waiting on 3 byte datas.
de: Wenn Ihr Programm mitten in der Kommunikation unterbrochen wird, kann die Firmware hängen bleiben und die Daten verschieben. Selbst wenn wir ein Timeout beim Warten auf 3-Byte-Daten haben.
ja: そして、通信の途中でプログラムが中断されると、ファームウェアが固まってデータがずれる可能性があります。3バイトのデータ待ちにはタイムアウトも設定しています。

source: If so, you need to reset the MCU. To reset it. You can use the robot_hat command:
de: Wenn dies der Fall ist, müssen Sie den MCU zurücksetzen. Um ihn zurückzusetzen, können Sie den Befehl robot_hat verwenden:
ja: そのような場合は、MCUをリセットする必要があります。リセットするには、robot_hatコマンドを使用できます：

source: Or you can do it in your python code:
de: Oder Sie können es in Ihrem Python-Code tun:
ja: または、Pythonコードで行うこともできます：

source: Or you can just pull down the reset pin (GPIO 5) for 10 ms, then pull it back up for another 10ms, as that's what ``reset_mcu`` dose.
de: Oder Sie können einfach den Reset-Pin (GPIO 5) für 10 ms herunterziehen und dann für weitere 10 ms wieder hochziehen, denn das ist es, was ``reset_mcu`` macht.
ja: あるいは、リセットピン（GPIO 5）を10ms引き下げてから、さらに10ms引き上げるだけで、それが ``reset_mcu`` が行うことです。
